Revit 2024 API
ExportLayerInfo.SetCutLayerModifiers Method
 Sets a cut layer modifier array to the layer info.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public void SetCutLayerModifiers(
	IList<LayerModifier> cutLayermodifiers
)
Visual Basic
Public Sub SetCutLayerModifiers ( _
	cutLayermodifiers As IList(Of LayerModifier) _
)
Visual C++
public:
void SetCutLayerModifiers(
	IList<LayerModifier^>^ cutLayermodifiers
)
Parameters
cutLayermodifiers
Type: System.Collections.Generic.IList<LayerModifier>
 The cut layer modifier array.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
ExportLayerInfo Class
Autodesk.Revit.DB Namespace